# vim:ft=ruby

tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "withgraphite/tap"

brew "asdf" # Extendable version manager
brew "autojump" # Shell extension to jump to frequently used directories
brew "ccat" # Like cat but displays content with syntax highlighting
brew "cmake" # Cross-platform make
brew "fastmod" # Fast partial replacement for the codemod tool
brew "ffmpeg" # Play, record, convert, and stream audio and video
brew "fx" # Terminal JSON viewer
brew "fzf" # Fuzzy file searcher, used in scripts and in vim
brew "gh" # GitHub CLI
brew "git" # Git version control (latest version)
brew "jq" # Lightweight and flexible command-line JSON processor
brew "libpq" # Postgres C API library
brew "make" # Utility for directing compilation
brew "ncdu" # NCurses Disk Usage
brew "neovim" # A better vim
brew "overmind" # Process manager for Procfile-based applications and tmux
brew "ripgrep" # very fast file searcher
brew "ssh-copy-id" # Add a public key to a remote machine's authorized_keys file
brew "tmux" # terminal multiplexer
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"] # Maintained ctags implementation
brew "wakeonlan" # Sends magic packets to wake up network-devices
brew "withgraphite/tap/graphite" # The Graphite CLI allows you to easily manage your stacked-diff workflow.
brew "zsh" # zsh (latest)

cask "dbeaver-community" # Universal database tool and SQL client
cask "firefox" # Firefox web browser
cask "font-fira-code" # Free monospaced font with programming ligatures
cask "handbrake" # Open-source video transcoder available for Linux, Mac, and Windows
cask "imageoptim" # Tool to optimize images to a smaller size
cask "notion" # App to write, plan, collaborate, and get organized
cask "raycast" # Control your tools with a few keystrokes
cask "spotify" # Music streaming service
cask "visual-studio-code"
cask "wezterm" # a better terminal emulator
